import styles from "./PublicAgreement.module.scss";
import logo from "../../images/logo.svg";
import { Link } from "react-router-dom";

export const PublicAgreement = () => {
  return (
    <div className={styles.container}>
      <p className={styles.logo_title}>
        <img className={styles.logo} src={logo} alt={"Logo"} />
        <span className={styles.author}>Мельник Андрій Володимирович</span>
      </p>
      <div className={styles.breadscrumbs}>
        <Link to={"/"}>Головна / </Link>Публічний договір
      </div>
      <div className={styles.title}>Публічний договір</div>
      <div className={styles.text}>
        <p>
          (ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ)про надання послуг у сфері підготовки до
          зовнішнього незалежного оцінювання Цей Договір, в якому одна сторона
          Фізична особа – підприємець Мельник Андрій Володимирович,
          зареєстрований в Єдиному державному реєстрі юридичних осіб та фізичних
          осіб – підприємців в установленому чинним законодавством порядку та
          який є платником єдиного податку (надалі – Виконавець), з одного боку,
          і будь-яка особа, яка прийняла (акцептувала) дану пропозицію (надалі –
          Замовник), з іншого боку, далі разом — Сторони, а кожний окремо –
          Сторона, уклали даний Договір (далі — Договір), адресований
          необмеженому колу осіб, який є офіційною публічною пропозицією
          Виконавця, укласти з будь-яким Замовником Договір про надання послуг у
          сфері освіти. При замовленні та оплаті Послуг Виконавця, Замовники
          приймають умови цього Договору про нижченаведене.
        </p>
        <br />
        1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
        <p>
          1.1. Цей Договір укладається шляхом надання повної й безумовної згоди
          (акцепту) Замовника на укладення Договору в повному обсязі, без
          підпису письмового примірника Договору Сторонами.
        </p>
        <p>
          1.2. Договір має юридичну силу відповідно до ст.ст. 633, 641, 642
          Цивільного кодексу України і є рівносильним Договору, підписаному
          Сторонами.
        </p>
        <p>
          1.3. Замовник підтверджує факт ознайомлення та згоди з усіма умовами
          цього Договору в повному обсязі шляхом акцептування.
        </p>
        <p>
          1.4. Будь-яка з наступних дій вважається акцептом цього договору
          публічної оферти:– факт реєстрації Замовника на Веб-сайті Виконавця та
          оформлення Замовлення Послуг Виконавця на веб-сайті
          Виконавця_______________________ – оплата Послуг Виконавця на умовах
          та в порядку, визначеними цим Договором та на відповідних сторінках
          Веб-сайту Виконавця __________________________________
        </p>
        <p>
          1.5. Укладаючи цей Договір Замовник автоматично погоджується з повним
          та безумовним прийняттям положень цього Договору і цін на Послуги.
        </p>
        <p>
          1.6. Якщо Замовник не згодний з умовами Договору, він не має права
          укладати цей Договір, а також не вправі користуватися Послугами за цим
          Договором.2. ТЕРМІНИ І ВИЗНАЧЕННЯ «Договір публічної оферти» -
          публічний договір, зразок якого розміщений на Веб-сайті
          ____________________ «Акцепт» - надання Замовником повної й безумовної
          згоди на укладення даного Договору в повному обсязі, без підпису
          письмового примірника Договору Сторонами. «Послуги» – Послуги в сфері
          освіти (а саме – доступ Замовника чи особи в чиїх інтересах виступає
          Замовник до запису онлайн-курсу «Інтенсив з військового права»), які
          надаються Виконавцем, та зазначені Виконавцем у відповідному розділі
          Веб-сайту Виконавця _______________________«Замовник» - будь-яка
          дієздатна фізична, фізична особа-підприємець, що відвідала Веб-сайт
          __________________________________ та акцептувала даний
          Договір.«Виконавець» - фізична особа підприємець, що надає послуги у
          сфері освіти до та реквізити якого зазначено у розділі 12 даного
          Договору.«Замовлення» - належно оформлена заявка Замовника на
          отримання Послуг, що адресується Виконавцю.
        </p>
        <p>3. ПРЕДМЕТ ДОГОВОРУ</p>
        <p>
          3.1. Виконавець зобов’язується на умовах та в порядку, визначених цим
          Договором, надати Замовнику Послуги в сфері освіти (а саме – доступ
          Замовника чи особи в чиїх інтересах виступає Замовник до запису
          онлайн-курсу «Інтенсив з військового права»), а Замовник
          зобов’язується на умовах та в порядку, визначених цим Договором,
          прийняти та оплатити замовлені Послуги.
        </p>
        <p>
          3.2. Замовник та Виконавець підтверджують, що даний Договір не є
          фіктивним чи удаваним правочином або правочином, укладеним під впливом
          тиску чи обману.
        </p>
        <p>
          3.3. Виконавець підтверджує, що має право на здійснення діяльності у
          сфері освіти, у відповідності з вимогами діючого законодавства
          України.
        </p>
        <p>4. ПРАВА ТА ОБОВ’ЯЗКИ ВИКОНАВЦЯ</p>{" "}
        <p>
          4.1. Виконавець зобов’язаний:· виконувати умови даного Договору;·
          надати Замовнику Послуги належної якості;· об’єктивно інформувати
          Замовника про Послуги та умови їх надання на Веб-сайті
          ____________________________________.
        </p>
        <p>
          4.2. Виконавець має право:· в односторонньому порядку призупинити
          надання послуг за цим Договором у випадку порушення Замовником умов
          цього Договору;· інші права відповідно до чинного законодавства
          України та цього Договору.
        </p>
        <p>5. ПРАВА ТА ОБОВ’ЯЗКИ ЗАМОВНИКА</p>{" "}
        <p>
          5.1. Замовник зобов’язаний:· своєчасно оплатити і отримати Замовлення
          на умовах цього Договору;· ознайомитись з інформацією про Послуги, яка
          розміщена на сайті Виконавця.
        </p>
        <p>
          5.2. Замовник має право:· оформити Замовлення Послуг, зазначених на
          відповідній сторінці Веб-сайту _____________________________________·
          вимагати від Виконавця надання Послуг відповідно до умов цього
          Договору;· інші права відповідно до чинного законодавства України та
          цього Договору.
        </p>
        <p>6. ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</p>
        <p>
          6.1. Замовник самостійно оформлює Замовлення на відповідній сторінці
          Веб-сайту _____________________________________
        </p>
        <p>
          6.2. Строк обробки Виконавцем Замовлення – до 3-х (трьох) робочих днів
          з моменту його оформлення. У разі, якщо Замовлення відправлено у
          вихідний або святковий день, строк обробки Замовлення починається з
          першого після вихідного робочого дня.
        </p>
        <p>7. ЦІНА ДОГОВОРУ І ПОРЯДОК ОПЛАТИ</p>{" "}
        <p>
          7.1. Ціна Послуг визначається Виконавцем та зазначається на
          відповідній сторінці Веб-сайту
          ________________________________________________________
        </p>
        <p>
          7.2. Замовник оплачує Послуги Виконавця на підставі цього Договору у
          Національній валюті України – гривні.
        </p>
        <p>
          7.3. Оплата Послуг здійснюється шляхом:7.3.1. перерахування грошових
          коштів на поточний рахунок Виконавця або7.3.2. за допомогою інших
          платіжних засобів, які вказані на Веб-сайті Виконавця.
        </p>
        <p>
          7.4. Моментом оплати Послуг вважається час зарахування грошових коштів
          на поточний рахунок Виконавця.
        </p>
        <p>
          7.5. Замовник самостійно та за свій рахунок сплачує вартість послуг
          третіх осіб, якщо це необхідно для отримання Послуг Виконавця за цим
          Договором (наприклад, послуги доступу до мережі Інтернет та інші).
        </p>
        <p>
          8. ПОРЯДОК ОТРИМАННЯ ПОСЛУГ. ПОРЯДОК ПРИЙМАННЯ-ПЕРЕДАЧІ НАДАНИХ
          ПОСЛУГ.
        </p>
        <p>
          8.1. Правила надання та отримання Послуг зазначені на відповідній
          сторінці Веб-сайту ________________________________________. Усі
          питання, що виникли в процесі оплати і отримання Послуг, Замовник може
          з'ясувати у Виконавця за контактними даними, зазначеними на сайті
          ____________________________________________ або в розділі 12 даного
          Договору.
        </p>
        <p>9. ВІДПОВІДАЛЬНІСТЬ СТОРІН ТА ВИРІШЕННЯ СПОРІВ</p>
        <p>
          9.1. За невиконання або неналежне виконання своїх зобов’язань за цим
          Договором, сторони несуть відповідальність відповідно до чинного
          законодавства України.
        </p>
        <p>
          9.2. Усі спори, що виникають з цього Договору або пов'язані із ним,
          вирішуються шляхом переговорів між Сторонами.
        </p>{" "}
        <p>
          9.3. Якщо відповідний спір не можливо вирішити шляхом переговорів, він
          вирішується в судовому порядку за встановленою підвідомчістю та
          підсудністю такого спору відповідно до чинного в Україні
          законодавства.
        </p>
        <p>
          9.4. Виконавець не несе будь-яку відповідальність за ненадання або
          неналежне надання Послуг Замовнику за умови настання будь-яких
          обставин, які виникли не з вини Виконавця (а саме – настання обставин,
          які виникли з вини чи необережності Замовника та / або настання
          обставин, які виникли з вини чи необережності будь-якої третьої особи
          (будь-яких третіх осіб) та /або настання форс-мажорних обставин).
        </p>{" "}
        <p>10. ФОРС-МАЖОРНІ ОБСТАВИНИ</p>
        <p>
          10.1. Сторони звільняються від відповідальності за невиконання або
          неналежне виконання зобов'язань, що передбачені даним Договором, якщо
          воно виникло внаслідок форс-мажорних обставин.
        </p>
        <p>
          10.2. Під форс-мажорними обставинами у даному Договорі розуміються
          будь-які обставини, що виникли поза волею або всупереч волі чи бажанню
          Сторін і яких не можна передбачити чи уникнути, включаючи: військові
          дії, громадські заворушення, епідемії, блокаду, землетруси, повені,
          пожежі, а також рішення чи приписи органів державної влади та
          управління держави, резидентом якої є Замовник, або держави,
          резидентом якої є Виконавець, внаслідок яких на Сторони (або одну із
          Сторін) покладатимуться додаткові обов'язки чи встановлюватимуться
          додаткові обмеження і які роблять неможливим подальше повне або
          часткове виконання Договору, а також інші дії чи події, що існують
          поза волею Сторін.
        </p>
        <p>
          10.3. Якщо форс-мажорні обставини триватимуть більше 3-х (трьох)
          місяців поспіль, то кожна із Сторін матиме право відмовитись від
          подальшого виконання зобов'язань за цим Договором і, в такому разі,
          жодна із Сторін не матиме права на відшкодування іншою Стороною
          можливих збитків.
        </p>
        <p>11. ІНШІ УМОВИ ДОГОВОРУ</p>
        <p>
          11.1. Кожна Сторона гарантує іншій Стороні, що володіє необхідною
          дієздатністю, а рівно всіма правами і повноваженнями, необхідними і
          достатніми для укладання і виконання цього Договору відповідно до його
          умов.
        </p>{" "}
        <p>
          11.2. Одностороння зміна умов укладеного Договору Замовником чи
          відмова виконувати умови укладеного Договору Замовником є
          неприпустимою, за винятків випадків, передбачених цим Договором. Жодна
          зі Сторін цього Договору не має права передавати свої права та
          обов’язки третім особам без згоди на це другої Сторони.
        </p>
        <p>
          11.3. Виконавець підтверджує, що є платником єдиного податку (група 3
          ) за ставкою, передбаченою Податковим кодексом України.
        </p>
        <p>
          11.4. Інформація, що надається Замовником є конфіденційною. Інформація
          про Замовника використовується виключно в цілях виконання його
          Замовлення.
        </p>
        <p>
          11.5. Власним акцептуванням Договору Замовник добровільно надає згоду
          на збір та обробку власних персональних даних з наступною метою: дані,
          що стають відомі, використовуватимуться в комерційних цілях, в тому
          числі отримання інформації про замовлення та обробки інформації про
          нього, надсилання телекомунікаційними засобами зв’язку (електронною
          поштою, мобільним зв’язком) рекламних та спеціальних пропозицій,
          інформації про акції або будь-якої іншої інформації про діяльність
          Веб-сайту _________________________________. У випадку небажання
          отримувати інформацію про діяльність Веб-сайту
          ____________________________________, Замовник має право звернутися до
          Виконавця і повідомити про відмову від отримання рекламних матеріалів.
        </p>
        <p>
          11.6. Виконавець не несе відповідальність за зміст і правдивість
          інформації, що надається Замовником при оформленні Замовлення.
          Замовник несе відповідальність за достовірність вказаної при
          оформленні Замовлення інформації.
        </p>
        <p>
          11.7. Замовнику надається право на використання Послуг Виконавця
          виключно у своїй внутрішній діяльності без права їх відчуження або
          передачі на користь третіх осіб.
        </p>
        <p>
          11.8. Сторони зобов’язуються зберігати конфіденційну інформацію,
          отриману в результаті виконання цього Договору, за винятком випадків,
          коли це письмово санкціоновано іншою Стороною або вимагається
          державними органами відповідно до чинного законодавства. За
          розголошення конфіденційної інформації винна Сторона несе
          відповідальність згідно з чинним законодавством.
        </p>
        <p>
          11.9. Договір є публічним і діє до його припинення у порядку,
          встановленому цим Договором. Цей Договір вважається погодженим
          Замовником та укладеним за місцезнаходженням Виконавця з дати
          акцептування.
        </p>
        <p>
          11.10. Виконавець самостійно у відповідності та на виконання вимог
          чинного законодавства України визначає умови даного договору.
          Виконавець має право самостійно змінити та/або доповнити умови цього
          публічного Договору, включаючи правила надання та отримання Послуг за
          даним Договором. При цьому Виконавець гарантує та підтверджує, що
          розміщена на Веб-сайті Виконавця поточна редакція тексту цього
          Договору, включаючи правила надання та отримання Послуг за даним
          Договором, є дійсною.
        </p>
        <p>12. РЕКВІЗИТИ ВИКОНАВЦЯ</p>
        <p>
          Фізична особа-підприємець Мельник Андрій
          ВолодимировичМісцезнаходження: м. Львів, вул. Сахарова, 58А, кв. 24Код
          за ЄДРПОУ 3296112030
        </p>
        <p>
          Банківські реквізити: UA463052990000026001001012798 Львівське ГРУ АТ
          КБ «ПРИВАТБАНК»E-mail: andriy.v.melnyk@gmail.com
        </p>
      </div>
    </div>
  );
};
